/**
 * @file task_oled.c
 * @brief 实现OLED任务
 * @author 李嘉图
 * @date 2026-05-08
 */

/*==============================================================================
 * 头文件包含
 *============================================================================*/
// 固定包含
#include <stdint.h>
#include <string.h>
#include "main.h"
// 功能包含
#include "oled.h"
#include "oled_ui.h"
#include "oled_extend.h"

/*==============================================================================
 * 任务函数
 *============================================================================*/
void Task_OLED(void *argument)
{
    OLED_Init();
    OLED_UI_FpsInit();

    for (;;)
    {
        OLED_UI_FpsTick();
        osDelay(1);
    }
}