/**
 * @file tsak_can.c
 * @brief 实现CAN控制任务，通过消息队列接收指令
 * @author 李嘉图
 * @date 2026-05-08
 */

/*==============================================================================
 * 头文件包含
 *============================================================================*/
#include "main.h"
#include "bsp_can.h"

/*==============================================================================
 * 任务函数
 *============================================================================*/
void StartCANTask(void *argument)
{
  CAN_Filter_Mask_Config(&hcan,CAN_FILTER(0) | CAN_FILT_1 | CAN_STDID | CAN_DATA_TYPE, 0x114, 0x7FF);
  CAN_Init(&hcan);
  for(;;)
  {
    osDelay(10);
  }
}