/**
 * @file tsak_tx.c
 * @brief 实现USART发送处理任务
 * @author 李嘉图
 * @date 2026-5-4
 */

/*==============================================================================
 * 头文件包含
 *============================================================================*/
#include "app_usart.h"

/*==============================================================================
 * 任务函数
 *============================================================================*/
/**
 * @brief TXTask 任务入口函数
 * @param argument 任务参数（未使用）
 */
void StartTXTask(void *argument)
{
  for(;;)
  {
    osSemaphoreAcquire(TXBinarySemHandle, osWaitForever);
    APP_USART_SendTxPacket();
  }
}