/**
 * @file bsp_key.h
 * @brief 按键硬件接口
 * @author 李嘉图
 * @date 2026-04-18
 */

#ifndef __BSP_KEY_H__
#define __BSP_KEY_H__

/*==============================================================================
 * 头文件包含
 *============================================================================*/
#include "gpio.h"

/*==============================================================================
 * 宏定义与常量
 *============================================================================*/
#define KEY_MAX_NUM 5    // 最大支持按键数量

/*==============================================================================
 * 按键结构体
 *============================================================================*/
typedef struct {
    uint8_t id;
    GPIO_TypeDef *GPIOx;
    uint16_t Pin;
} BSP_Key_t;

/*==============================================================================
 * 初始化函数
 *============================================================================*/
/**
 * @brief 按键初始化
 */
void BSP_Key_Init(void);

/**
 * @brief 注册一个按键到资源池
 * @param key_id  按键ID
 * @param GPIOx   GPIO端口
 * @param Pin     引脚
 * @retval 0: 参数错误/重复
 * @retval 1: 成功
 * @retval 2: 资源池已满
 */
uint8_t BSP_Key_Register(uint8_t key_id, GPIO_TypeDef *GPIOx, uint16_t Pin);

/*==============================================================================
 * 功能函数
 *============================================================================*/
/**
 * @brief 按键电平状态获取
 * @param key_id 按键ID
 * @retval 1: 高电平
 * @retval 0: 低电平
 * @retval 0xFF: 未找到
 */
uint8_t BSP_Key_ReadState(uint8_t key_id);

#endif /* __BSP_KEY_H__ */
