/**
 * @file bsp_rk.c
 * @brief 旋钮硬件接口实现
 * @author 李嘉图
 * @date 2026-04-18
 */

/*==============================================================================
 * 头文件包含
 *============================================================================*/
#include "main.h"
#include "bsp_rk.h"

/*==============================================================================
 * 初始化函数
 *============================================================================*/
/**
 * @brief 初始化旋钮ADC
 */
void BSP_RK_Init(void)
{
   HAL_ADC_Start(&hadc1);
}

/**
 * @brief 初始化旋钮ADC
 */
float BSP_RK_Getvalue(void)
{
    return HAL_ADC_GetValue(&hadc1);
}

