/**
 * @file app_key_cmd.h
 * @brief 按键命令分发
 * @author 李嘉图
 * @date 2026-06-18
 */

#ifndef __APP_KEY_CMD_H__
#define __APP_KEY_CMD_H__

/*==============================================================================
 * 头文件包含
 *============================================================================*/
// 固定包含
#include <stdint.h>
#include "app_key.h"

/*==============================================================================
 * 命令分发
 *============================================================================*/
/**
 * @brief 按键命令分发
 */
void App_Key_CMD_Packet(uint8_t key_id, App_Key_Event_t event);

#endif
